open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_companion.c
  put_be32(window, 2u * BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  rx = fake_rx(BKVOICE_COMPANION_WINDOW_UPDATE, 0, sizeof(window),
               first_session, 0, 2);
  assert(bkvoice_companion_session_rx(&session, &rx, window) == 0);
  assert(session.tx_window == 2u * BKVOICE_COMPANION_AUDIO_FRAME_BYTES);

  assert(bkvoice_companion_session_tx(&session,
                                      BKVOICE_COMPANION_TURN_START,
                                      0, NULL, 0, 200, &tx) == 0);
  first_turn = tx.turn_id;
  assert(first_turn != 0 && session.state == BKVOICE_COMPANION_UPLINK);

  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_AUDIO_UP,
                                      0, audio, sizeof(audio), 220,
                                      &tx) == 0);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_AUDIO_UP,
                                      0, audio, sizeof(audio), 240,
                                      &tx) == 0);
  assert(session.tx_window == 0);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_AUDIO_UP,
                                      0, audio, sizeof(audio), 260,
                                      &tx) == -EAGAIN);
  assert(session.tx_sequence == 4);

  put_be32(window, BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  rx = fake_rx(BKVOICE_COMPANION_WINDOW_UPDATE, 0, sizeof(window),
               first_session, first_turn, 3);
  assert(bkvoice_companion_session_rx(&session, &rx, window) == 0);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_AUDIO_UP,
                                      0, audio, sizeof(audio), 260,
                                      &tx) == 0);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_TURN_END,
                                      0, NULL, 0, 280, &tx) == 0);
  assert(session.state == BKVOICE_COMPANION_THINKING);

  put_be32(window, 2u * BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  assert(bkvoice_companion_session_tx(
           &session, BKVOICE_COMPANION_WINDOW_UPDATE, 0, window,
           sizeof(window), 290, &tx) == 0);
  assert(session.rx_window == 2u * BKVOICE_COMPANION_AUDIO_FRAME_BYTES);

  rx = fake_rx(BKVOICE_COMPANION_TTS_START,
               BKVOICE_COMPANION_FLAG_SYNTHETIC, 0,
               first_session, first_turn, 4);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == 0);
  assert(session.state == BKVOICE_COMPANION_DOWNLINK);
  rx = fake_rx(BKVOICE_COMPANION_AUDIO_DOWN,
               BKVOICE_COMPANION_FLAG_SYNTHETIC, sizeof(audio),
               first_session, first_turn, 5);
  assert(bkvoice_companion_session_rx(&session, &rx, audio) == 0);
  rx.sequence = 6;
  assert(bkvoice_companion_session_rx(&session, &rx, audio) == 0);
  assert(session.rx_window == 0);
  rx.sequence = 7;
  assert(bkvoice_companion_session_rx(&session, &rx, audio) == -ENOBUFS);
  assert(session.rx_sequence == 6);

  put_be32(window, BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  assert(bkvoice_companion_session_tx(
           &session, BKVOICE_COMPANION_WINDOW_UPDATE, 0, window,
           sizeof(window), 310, &tx) == 0);
  assert(bkvoice_companion_session_rx(&session, &rx, audio) == 0);
  rx = fake_rx(BKVOICE_COMPANION_TTS_END,
               BKVOICE_COMPANION_FLAG_SYNTHETIC, 0,
               first_session, first_turn, 8);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == 0);
  assert(session.state == BKVOICE_COMPANION_IDLE);

  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == -EALREADY);
  rx = fake_rx(BKVOICE_COMPANION_HEARTBEAT, 0, 0,
               first_session, 0, 10);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == -EPROTO);
  rx.sequence = 9;
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == 0);

  assert(bkvoice_companion_session_tx(&session,
                                      BKVOICE_COMPANION_TURN_START,
                                      0, NULL, 0, 320, &tx) == 0);
  assert(tx.turn_id == first_turn + 1u);
  rx = fake_rx(BKVOICE_COMPANION_ERROR, 0, 0,
               first_session, first_turn, 10);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == -ESTALE);
  assert(session.state == BKVOICE_COMPANION_UPLINK);
  assert(session.rx_sequence == 9);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_CANCEL,
                                      0, NULL, 0, 321, &tx) == 0);
  assert(session.state == BKVOICE_COMPANION_IDLE);
  rx = fake_rx(BKVOICE_COMPANION_TTS_START,
               BKVOICE_COMPANION_FLAG_SYNTHETIC, 0,
               first_session, first_turn, 10);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == -ESTALE);
  assert(session.rx_sequence == 9);

  bkvoice_companion_session_disconnect(&session);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == -ENOTCONN);
  assert(bkvoice_companion_session_connect(&session) == 0);
  second_session = session.session_id;
  assert(second_session == first_session + 1u);
  rx = fake_rx(BKVOICE_COMPANION_WELCOME, 0, 0,
               first_session, 0, 1);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == -ESTALE);
  rx.session_id = second_session;
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == -EPERM);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_HELLO,
                                      0, NULL, 0, 400, &tx) == 0);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == 0);
  assert(session.state == BKVOICE_COMPANION_IDLE);

  put_be32(window, BKVOICE_COMPANION_MAX_WINDOW);
  rx = fake_rx(BKVOICE_COMPANION_WINDOW_UPDATE, 0, sizeof(window),
               second_session, 0, 2);
  assert(bkvoice_companion_session_rx(&session, &rx, window) == 0);
  put_be32(window, 1);
  rx.sequence = 3;
  assert(bkvoice_companion_session_rx(&session, &rx, window) ==
         -EOVERFLOW);
  assert(session.rx_sequence == 2);

  put_be32(window, BKVOICE_COMPANION_MAX_WINDOW);
  assert(bkvoice_companion_session_tx(
           &session, BKVOICE_COMPANION_WINDOW_UPDATE, 0, window,
           sizeof(window), 410, &tx) == 0);
  put_be32(window, 1);
  assert(bkvoice_companion_session_tx(
           &session, BKVOICE_COMPANION_WINDOW_UPDATE, 0, window,
           sizeof(window), 411, &tx) == -EOVERFLOW);

  session.turn_id = UINT32_MAX;
  assert(bkvoice_companion_session_tx(&session,
                                      BKVOICE_COMPANION_TURN_START,
                                      0, NULL, 0, 420, &tx) == -EOVERFLOW);
  session.turn_id = 0;
  session.tx_sequence = UINT32_MAX - 1u;
  assert(bkvoice_companion_session_tx(&session,
                                      BKVOICE_COMPANION_HEARTBEAT,
                                      0, NULL, 0, 430, &tx) == -EOVERFLOW);

  session.rx_sequence = UINT32_MAX - 1u;
  rx = fake_rx(BKVOICE_COMPANION_HEARTBEAT, 0, 0,
               second_session, 0, UINT32_MAX);
  assert(bkvoice_companion_session_rx(&session, &rx, NULL) == -EOVERFLOW);

  bkvoice_companion_session_disconnect(&session);
  session.last_session_id = UINT32_MAX;
  assert(bkvoice_companion_session_connect(&session) == -EOVERFLOW);
}

