open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_companion.c
static void test_connection_error(void)
{
  struct bkvoice_companion_session_s session;
  struct bkvoice_companion_header_s header;
  uint32_t first_session;

  assert(bkvoice_companion_session_init(&session, 7) == 0);
  assert(bkvoice_companion_session_connect(&session) == 0);
  first_session = session.session_id;
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_HELLO,
                                      0, NULL, 0, 1, &header) == 0);
  header = fake_rx(BKVOICE_COMPANION_WELCOME, 0, 0,
                   first_session, 0, 1);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);

  header = fake_rx(BKVOICE_COMPANION_ERROR, 0, 0,
                   first_session, 0, 2);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);
  assert(session.state == BKVOICE_COMPANION_DISCONNECTED);
  assert(session.session_id == 0 && session.rx_sequence == 0);
  assert(bkvoice_companion_session_connect(&session) == 0);
  assert(session.session_id == first_session + 1u);
}

static void test_late_remote_cancel(void)
{
  struct bkvoice_companion_session_s session;
  struct bkvoice_companion_header_s header;

  assert(bkvoice_companion_session_init(&session, 7) == 0);
  assert(bkvoice_companion_session_connect(&session) == 0);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_HELLO,
                                      0, NULL, 0, 1, &header) == 0);
  header = fake_rx(BKVOICE_COMPANION_WELCOME, 0, 0, session.session_id, 0, 1);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);
  header = fake_rx(BKVOICE_COMPANION_CANCEL, 0, 0, session.session_id, 0, 2);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) < 0);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_TURN_START,
                                      0, NULL, 0, 2, &header) == 0);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_TURN_END,
                                      0, NULL, 0, 3, &header) == 0);
  header = fake_rx(BKVOICE_COMPANION_TTS_START,
                   BKVOICE_COMPANION_FLAG_SYNTHETIC, 0, session.session_id, 1, 2);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);
  header.type = BKVOICE_COMPANION_TTS_END;
  header.sequence++;
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);
  header.type = BKVOICE_COMPANION_CANCEL;
  header.flags = 0;
  header.sequence++;
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);
  assert(session.state == BKVOICE_COMPANION_IDLE);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == -EALREADY);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_TURN_START,
                                      0, NULL, 0, 4, &header) == 0);
  header = fake_rx(BKVOICE_COMPANION_CANCEL, 0, 0, session.session_id, 1, 5);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == -ESTALE);
  assert(session.state == BKVOICE_COMPANION_UPLINK);
  assert(session.rx_sequence == 4);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_CANCEL,
                                      0, NULL, 0, 5, &header) == 0);
  header = fake_rx(BKVOICE_COMPANION_CANCEL, 0, 0, session.session_id, 2, 5);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);
}

static void test_volume_contract(void)
{
  struct bkvoice_companion_session_s session;
  struct bkvoice_companion_header_s header;
  struct bkvoice_companion_header_s decoded;
  uint8_t value[4];
  uint8_t report[12];
  uint8_t wire[64];
  const uint8_t *payload;
  size_t size;

  assert(bkvoice_companion_session_init(&session, 7) == 0);
  assert(bkvoice_companion_session_connect(&session) == 0);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_HELLO,
                                     0, NULL, 0, 1, &header) == 0);
  header = fake_rx(BKVOICE_COMPANION_WELCOME, 0, 0, session.session_id, 0, 1);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);
  header = fake_rx(BKVOICE_COMPANION_VOLUME_GET, 0, 0, session.session_id, 0, 2);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == -ENOTSUP);
  assert(session.rx_sequence == 1);

  bkvoice_companion_session_disconnect(&session);
  assert(bkvoice_companion_session_connect(&session) == 0);
  put_be32(value, BKVOICE_COMPANION_CAP_VOLUME);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_HELLO,
                                     0, value, 4, 1, &header) == 0);
  header = fake_rx(BKVOICE_COMPANION_WELCOME, 0, 0, session.session_id, 0, 1);
  assert(bkvoice_companion_session_rx(&session, &header, NULL) == 0);
  header = fake_rx(BKVOICE_COMPANION_VOLUME_SET, 0, 4, session.session_id, 0, 2);
  put_be32(value, 101);
  assert(bkvoice_companion_session_rx(&session, &header, value) == -ERANGE);
  assert(session.rx_sequence == 1);
  put_be32(value, 65);
  assert(bkvoice_companion_session_rx(&session, &header, value) == 0);
  assert(bkvoice_companion_session_rx(&session, &header, value) == -EALREADY);
  put_be32(report, 2);
  put_be32(report + 4, 0);
  put_be32(report + 8, 65);
  assert(bkvoice_companion_session_tx(&session, BKVOICE_COMPANION_VOLUME_REPORT,
                                     0, report, 12, 2, &header) == 0);
  assert(header.turn_id == 0);
  assert(bkvoice_companion_encode(&header, report, wire, sizeof(wire), &size) == 0);
  assert(bkvoice_companion_decode(wire, size, &decoded, &payload) == 0);
  assert(memcmp(payload, report, 12) == 0);
  wire[BKVOICE_COMPANION_HEADER_BYTES + 11] = 101;
  assert(bkvoice_companion_decode(wire, size, &decoded, &payload) == -ERANGE);
  put_be32(report + 4, (uint32_t)-EIO);
  assert(bkvoice_companion_encode(&header, report, wire, sizeof(wire), &size) == -ERANGE);
  put_be32(report + 8, UINT32_MAX);
  assert(bkvoice_companion_encode(&header, report, wire, sizeof(wire), &size) == 0);
  bkvoice_companion_session_disconnect(&session);
  assert(bkvoice_companion_session_connect(&session) == 0);
  assert(session.capabilities == 0);
}

static void test_status_report_contract(void)
{
  struct bkvoice_companion_session_s session;
  struct bkvoice_companion_header_s header;
  struct bkvoice_companion_header_s decoded;
  uint8_t capabilities[4];
  uint8_t report[BKVOICE_COMPANION_STATUS_REPORT_BYTES] = {0};
  uint8_t report_v2[BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES] = {0};
  uint8_t wire[96];
  const uint8_t *payload;
  size_t size;

  report[0] = 1;
  report[1] = 73;
  report[2] = 1;
  report[3] = BKVOICE_COMPANION_BATTERY_STATE_CHARGING;
  put_be32(report + 4, 3800);
  put_be16(report + 8, 1);
  put_be16(report + 10, 2);
  put_be16(report + 12, 3);
  put_be16(report + 14, 0);
  put_be32(report + 16, 4);

